---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.FabricAreaFailures
source: html/5f812624-6bf0-37fc-971a-421ca56a151d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricAreaFailures

Failures related to fabric area elements.

## Syntax (C#)
```csharp
public static class FabricAreaFailures
```